{
  "Apple___Apple_scab": {
    "title": "Парша яблони",
    "pathogen": "грибок Venturia inaequalis",
    "plant_name": "Яблоня",
    "description": "На листьях и плодах появляются бархатистые оливково-бурые пятна. Листовые пластинки деформируются, на яблоках возникают трещины, что снижает товарность урожая.",
    "treatment": "Удалите поражённые листья и плоды, проведите 2–3 обработки системными фунгицидами (дифеноконазол, пираклостробин) с интервалом 10–14 дней.",
    "prevention": "Убирайте опавшую листву осенью, прореживайте крону и выбирайте сорта, устойчивые к парше."
  },
  "Apple___Black_rot": {
    "title": "Чёрная гниль яблони",
    "pathogen": "грибок Diplodia seriata",
    "plant_name": "Яблоня",
    "description": "На плодах заметны концентрические кольца и чернеющие участки, листовые прожилки буреют, кора покрывается язвами.",
    "treatment": "Вырежьте поражённые ветви, обработайте дерево фунгицидами на основе меди или стробилуринов, повторяйте обработку после дождей.",
    "prevention": "Проводите санитарную обрезку и избегайте повреждений коры во время сбора урожая."
  },
  "Apple___Cedar_apple_rust": {
    "title": "Ржавчина яблони",
    "pathogen": "грибок Gymnosporangium juniperi-virginianae",
    "plant_name": "Яблоня",
    "description": "На верхней стороне листа формируются жёлто-оранжевые пятна, снизу образуются оранжевые подушечки с спорами. При сильном поражении листья преждевременно опадают.",
    "treatment": "Удалите поблизости можжевельники — промежуточных хозяев. Обработайте яблони системными фунгицидами (пропиконазол, дифеноконазол).",
    "prevention": "Выбирайте устойчивые сорта и поддерживайте достаточную циркуляцию воздуха в кроне."
  },
  "Apple___healthy": {
    "title": "Здоровая яблоня",
    "pathogen": "нет",
    "plant_name": "Яблоня",
    "description": "Листья и плоды выглядят здоровыми, признаков заболеваний не обнаружено.",
    "treatment": "Никаких действий не требуется — поддерживайте стандартный уход.",
    "prevention": "Соблюдайте регулярный полив, подкормки и санитарную обрезку."
  },
  "Blueberry___healthy": {
    "title": "Здоровая голубика",
    "pathogen": "нет",
    "plant_name": "Голубика",
    "description": "Растение без видимых симптомов заболеваний или дефицита питания.",
    "treatment": "Поддерживайте режим полива и кислотность почвы pH 4.5–5.5.",
    "prevention": "Проводите мульчирование и избегайте переувлажнения корней."
  },
  "Cherry_(including_sour)___Powdery_mildew": {
    "title": "Мучнистая роса вишни/черешни",
    "pathogen": "грибок Podosphaera clandestina",
    "plant_name": "Вишня/черешня",
    "description": "На молодых листьях появляется белый мучнистый налёт, ткани буреют и скручиваются, почки задерживаются в росте.",
    "treatment": "Удалите поражённые побеги, проведите обработку серосодержащими препаратами или фунгицидами класса стробилуринов.",
    "prevention": "Обеспечьте хорошее освещение и вентиляцию кроны, избегайте избытка азота в удобрениях."
  },
  "Cherry_(including_sour)___healthy": {
    "title": "Здоровая вишня/черешня",
    "pathogen": "нет",
    "plant_name": "Вишня/черешня",
    "description": "Признаки заболеваний отсутствуют.",
    "treatment": "Продолжайте стандартный уход и наблюдение.",
    "prevention": "Санитарная обрезка и защита от вредителей в период вегетации."
  },
  "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": {
    "title": "Серый пятнистый налёт кукурузы",
    "pathogen": "грибок Cercospora zeae-maydis",
    "plant_name": "Кукуруза",
    "description": "Узкие прямоугольные пятна серого оттенка между прожилками листа, которые сливаются и приводят к преждевременному отмиранию листьев.",
    "treatment": "Примените системные фунгициды (трифлоксистробин, пропиконазол) на ранних стадиях развития болезни и повторите обработку через 2–3 недели при влажной погоде.",
    "prevention": "Соблюдайте севооборот и используйте устойчивые гибриды кукурузы, уменьшайте количество растительных остатков на поле."
  },
  "Corn_(maize)___Common_rust_": {
    "title": "Пузырчатая ржавчина кукурузы",
    "pathogen": "грибок Puccinia sorghi",
    "plant_name": "Кукуруза",
    "description": "На верхней стороне листа появляются мелкие продолговатые пузыри цвета ржавчины, которые вскрываются и выделяют порошкообразные споры.",
    "treatment": "При сильном поражении примените фунгициды с действующими веществами азоксистробин или мепикват.",
    "prevention": "Выбирайте устойчивые гибриды и высаживайте кукурузу в оптимальные сроки, чтобы избегать длительных периодов влажности."
  },
  "Corn_(maize)___Northern_Leaf_Blight": {
    "title": "Северная гельминтоспориозная пятнистость",
    "pathogen": "грибок Exserohilum turcicum",
    "plant_name": "Кукуруза",
    "description": "Длинные серо-зелёные эллиптические пятна на листьях, которые разрастаются и приводят к гибели листовой ткани, снижают налив зерна.",
    "treatment": "Обработайте посевы системными фунгицидами в фазе выбрасывания метёлки.",
    "prevention": "Севооборот с бобовыми культурами и заделка растительных остатков уменьшают риск."
  },
  "Corn_(maize)___healthy": {
    "title": "Здоровая кукуруза",
    "pathogen": "нет",
    "plant_name": "Кукуруза",
    "description": "Визуальные симптомы болезней не обнаружены.",
    "treatment": "Дополнительные обработки не требуются.",
    "prevention": "Поддерживайте оптимальный водный режим и питание растений."
  },
  "Grape___Black_rot": {
    "title": "Чёрная гниль винограда",
    "pathogen": "грибок Guignardia bidwellii",
    "plant_name": "Виноград",
    "description": "Листья покрываются светлыми пятнами с тёмной каймой, на ягодах образуются чёрные мумифицированные грозди.",
    "treatment": "Удалите поражённые грозди и обработайте кусты системными фунгицидами (каптан, миклобутанил) каждые 10–14 дней в дождливый период.",
    "prevention": "Обеспечьте хорошую вентиляцию и проводите прореживание лозы."
  },
  "Grape___Esca_(Black_Measles)": {
    "title": "Эска (чёрная корь) винограда",
    "pathogen": "комплекс древесных грибов",
    "plant_name": "Виноград",
    "description": "Листья демонстрируют полосатый рисунок «тигровой» окраски, ягоды засыхают и растрескиваются, древесина поражается некрозом.",
    "treatment": "Вырежьте поражённые рукава и продезинфицируйте срезы. Применяйте биопрепараты на основе Trichoderma для заселения ран.",
    "prevention": "Не допускайте повреждений лозы и используйте качественный посадочный материал."
  },
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": {
    "title": "Пятнистость листьев винограда (Isariopsis)",
    "pathogen": "грибок Pseudocercospora vitis",
    "plant_name": "Виноград",
    "description": "Листья покрываются угловатыми серо-бурыми пятнами, нижняя сторона листа покрывается серовато-фиолетовым налётом.",
    "treatment": "Обработайте кусты контактными фунгицидами (манкоцеб, хлорокись меди) и удалите сильно поражённые листья.",
    "prevention": "Соблюдайте баланс азотных удобрений и своевременно проветривайте крону."
  },
  "Grape___healthy": {
    "title": "Здоровый виноград",
    "pathogen": "нет",
    "plant_name": "Виноград",
    "description": "Листья чистые, ягоды без признаков гнилей или пятнистости.",
    "treatment": "Поддерживайте плановый уход и режим полива.",
    "prevention": "Регулярная обрезка и профилактические обработки от милдью и оидиума."
  },
  "Orange___Haunglongbing_(Citrus_greening)": {
    "title": "Хуанлунбин (позеленение цитрусов)",
    "pathogen": "бактериальная инфекция Candidatus Liberibacter",
    "plant_name": "Апельсин",
    "description": "Листья мозаично желтеют, плоды остаются мелкими и асимметричными, растение постепенно чахнет. Болезнь передаётся азиатской псиллидой.",
    "treatment": "Болезнь неизлечима: удаляйте заражённые деревья и контролируйте популяцию переносчика инсектицидами (имидаклоприд, спиносад).",
    "prevention": "Используйте сертифицированные саженцы и устанавливайте карантинные меры при появлении псиллид."
  },
  "Peach___Bacterial_spot": {
    "title": "Бактериальная пятнистость персика",
    "pathogen": "бактерия Xanthomonas arboricola pv. pruni",
    "plant_name": "Персик",
    "description": "Мелкие водянистые пятна на листьях переходят в отверстия, на плодах появляются тёмные язвочки с камедетечением.",
    "treatment": "Удалите заражённые побеги, проведите обработки медьсодержащими препаратами и бактерицидами (оксихлорид меди, касугамицин).",
    "prevention": "Выбирайте устойчивые сорта и избегайте механических повреждений плодов."
  },
  "Peach___healthy": {
    "title": "Здоровый персик",
    "pathogen": "нет",
    "plant_name": "Персик",
    "description": "Растение без признаков бактериальных или грибковых заболеваний.",
    "treatment": "Специальные меры не требуются, поддерживайте базовый уход.",
    "prevention": "Белите стволы и проводите профилактические опрыскивания ранней весной."
  },
  "Pepper,_bell___Bacterial_spot": {
    "title": "Бактериальная пятнистость сладкого перца",
    "pathogen": "бактерия Xanthomonas euvesicatoria",
    "plant_name": "Перец сладкий",
    "description": "На листьях появляются водянистые пятна с тёмной каймой, которые подсыхают и превращаются в дырочки. Плоды покрываются мелкими язвами.",
    "treatment": "Уберите больные растения, проведите обработки бактерицидами (медь, касугамицин) и применяйте капельный полив, чтобы не смачивать листья.",
    "prevention": "Используйте здоровый посевной материал и чередуйте культуры в теплице."
  },
  "Pepper,_bell___healthy": {
    "title": "Здоровый сладкий перец",
    "pathogen": "нет",
    "plant_name": "Перец сладкий",
    "description": "Листья ровные, без пятен и деформаций.",
    "treatment": "Продолжайте наблюдение и придерживайтесь сбалансированного питания растений.",
    "prevention": "Обеспечьте хорошую вентиляцию теплицы и умеренный полив."
  },
  "Potato___Early_blight": {
    "title": "Ранняя фитофторозная пятнистость картофеля",
    "pathogen": "грибок Alternaria solani",
    "plant_name": "Картофель",
    "description": "Листья покрываются тёмными концентрическими кругами, края сохнут. На клубнях возникают вдавленные пятна с бурой мякотью.",
    "treatment": "Обработайте посадки фунгицидами (мандипропамид, хлороталонил) при первых признаках и повторяйте каждые 7–10 дней в тёплую влажную погоду.",
    "prevention": "Соблюдайте севооборот и уничтожайте растительные остатки после уборки урожая."
  },
  "Potato___Late_blight": {
    "title": "Поздний фитофтороз картофеля",
    "pathogen": "Phytophthora infestans",
    "plant_name": "Картофель",
    "description": "На листьях появляются бурые водянистые пятна с белым пушистым налётом по краям, клубни буреют изнутри и гниют.",
    "treatment": "Применяйте системные фунгициды (металаксил, цимоксанил) и чередуйте действующие вещества для предотвращения резистентности.",
    "prevention": "Используйте здоровый посадочный материал и обеспечьте дренаж почвы."
  },
  "Potato___healthy": {
    "title": "Здоровый картофель",
    "pathogen": "нет",
    "plant_name": "Картофель",
    "description": "Листья насыщенного цвета, без пятен и увядания.",
    "treatment": "Поддерживайте агротехнику и профилактические обработки от фитофтороза.",
    "prevention": "Регулярно окучивайте кусты и соблюдайте севооборот."
  },
  "Raspberry___healthy": {
    "title": "Здоровая малина",
    "pathogen": "нет",
    "plant_name": "Малина",
    "description": "Признаки грибковых и вирусных заболеваний не обнаружены.",
    "treatment": "Наблюдайте за посадками и своевременно подвязывайте побеги.",
    "prevention": "Убирайте опавшие листья и обеспечьте проветривание ряда."
  },
  "Soybean___healthy": {
    "title": "Здоровая соя",
    "pathogen": "нет",
    "plant_name": "Соя",
    "description": "Растение выглядит жизнеспособным, листовая пластинка без некрозов.",
    "treatment": "Поддерживайте плановый контроль сорняков и вредителей.",
    "prevention": "Соблюдайте севооборот и баланс азота в почве."
  },
  "Squash___Powdery_mildew": {
    "title": "Мучнистая роса тыквенных",
    "pathogen": "грибок Podosphaera xanthii",
    "plant_name": "Тыквенные",
    "description": "Белый мучнистый налёт появляется на верхней стороне листьев, быстро покрывает всю пластинку и приводит к увяданию.",
    "treatment": "Удалите сильно поражённые листья, обработайте растения серой, калийной содой или биофунгицидами (Bacillus subtilis).",
    "prevention": "Выбирайте устойчивые сорта и избегайте переизбытка азота при подкормках."
  },
  "Strawberry___Leaf_scorch": {
    "title": "Краевой ожог листьев клубники",
    "pathogen": "грибок Diplocarpon earlianum",
    "plant_name": "Клубника",
    "description": "На листьях появляются пурпурные пятна, которые сливаются и образуют бурые засыхающие участки по краю листа.",
    "treatment": "Удалите больные листья и обработайте посадки контактными фунгицидами (каптан, манкоцеб).",
    "prevention": "Обеспечьте хороший дренаж и избегайте полива по листу."
  },
  "Strawberry___healthy": {
    "title": "Здоровая клубника",
    "pathogen": "нет",
    "plant_name": "Клубника",
    "description": "Кусты здоровы, повреждений и пятнистостей не обнаружено.",
    "treatment": "Продолжайте стандартный уход и профилактику серой гнили.",
    "prevention": "Мульчируйте грядки и соблюдайте режим полива."
  },
  "Tomato___Bacterial_spot": {
    "title": "Бактериальная пятнистость томата",
    "pathogen": "бактерии рода Xanthomonas",
    "plant_name": "Томат",
    "description": "На листьях образуются мелкие коричневые пятна с жёлтым ореолом, плоды покрываются грубыми пятнами и трескаются.",
    "treatment": "Удалите поражённые растения, обработайте посадки бактерицидами (медь, касугамицин) и обеспечьте капельный полив.",
    "prevention": "Используйте протравленные семена и соблюдайте севооборот не менее 3 лет."
  },
  "Tomato___Early_blight": {
    "title": "Ранняя фитофторозная пятнистость томата",
    "pathogen": "Alternaria solani",
    "plant_name": "Томат",
    "description": "На нижних листьях появляются коричневые пятна с концентрическими кольцами, которые постепенно переходят на стебли и плоды.",
    "treatment": "Примените фунгициды (хлороталонил, дифеноконазол) и удалите поражённые листья.",
    "prevention": "Контролируйте полив, избегайте смачивания листьев и регулярно пасынкуйте кусты."
  },
  "Tomato___Late_blight": {
    "title": "Поздний фитофтороз томата",
    "pathogen": "Phytophthora infestans",
    "plant_name": "Томат",
    "description": "Тёмные водянистые пятна быстро распространяются по листу, на нижней стороне появляется белёсый спороносящий налёт, плоды буреют и гниют.",
    "treatment": "Используйте системные фунгициды (цимоксанил, пропамокарб) и повторяйте обработки каждые 7–10 дней в неблагоприятную погоду.",
    "prevention": "Обеспечьте укрытие от дождей, проветривание теплицы и высаживайте устойчивые гибриды."
  },
  "Tomato___Leaf_Mold": {
    "title": "Кладоспориоз (листовая плесень) томата",
    "pathogen": "грибок Fulvia fulva",
    "plant_name": "Томат",
    "description": "На верхней стороне листьев появляются жёлтые пятна, а снизу — оливково-коричневый налёт, в результате лист скручивается и отмирает.",
    "treatment": "Снизьте влажность воздуха, удалите поражённые листья и примените фунгициды (хлороталонил, меди).",
    "prevention": "Регулируйте влажность в теплице и проводите обеззараживание инвентаря."
  },
  "Tomato___Septoria_leaf_spot": {
    "title": "Септориоз листьев томата",
    "pathogen": "грибок Septoria lycopersici",
    "plant_name": "Томат",
    "description": "Мелкие серые пятна с тёмной каймой сначала поражают нижние листья, затем поднимаются вверх, вызывая сильное опадение листвы.",
    "treatment": "Удалите заражённые листья, обработайте растения контактными фунгицидами (манкоцеб, медь).",
    "prevention": "Мульчируйте почву, чтобы уменьшить всплески спор при поливе."
  },
  "Tomato___Spider_mites Two-spotted_spider_mite": {
    "title": "Паутинный клещ на томате",
    "pathogen": "Tetranychus urticae",
    "plant_name": "Томат",
    "description": "На листьях появляются мелкие светлые точки и серебристость, с нижней стороны образуется паутинка, листья желтеют и опадают.",
    "treatment": "Повышайте влажность воздуха, смойте вредителей водой и примените акарициды (абамектин, бифеназат) по инструкции.",
    "prevention": "Регулярно осматривайте растения и заносите в теплицу только проверенные саженцы."
  },
  "Tomato___Target_Spot": {
    "title": "Целевая пятнистость томата",
    "pathogen": "грибок Corynespora cassiicola",
    "plant_name": "Томат",
    "description": "На листьях появляются круглые пятна с концентрическими кольцами и светлым центром, которые переходят на стебли и плоды.",
    "treatment": "Удалите поражённые листья и используйте системные фунгициды (хлороталонил, азоксистробин).",
    "prevention": "Поддерживайте циркуляцию воздуха и удаляйте растительные остатки после уборки."
  },
  "Tomato___Tomato_Yellow_Leaf_Curl_Virus": {
    "title": "Вирус жёлтой курчавости листьев томата",
    "pathogen": "бегомовирус, переносимый белокрылкой",
    "plant_name": "Томат",
    "description": "Листья скручиваются вверх, становятся жёлтыми, рост растений угнетается, плоды не завязываются.",
    "treatment": "Специфического лечения нет: удалите больные кусты и проведите борьбу с белокрылкой инсектицидами (спиносад, бифентрин).",
    "prevention": "Используйте устойчивые гибриды, устанавливайте сетки и клеевые ловушки против белокрылки."
  },
  "Tomato___Tomato_mosaic_virus": {
    "title": "Вирус мозаики томата",
    "pathogen": "томатовирус Tobamovirus",
    "plant_name": "Томат",
    "description": "Листья покрываются мозаичным рисунком из светлых и тёмно-зелёных пятен, растение задерживается в росте, плоды деформируются.",
    "treatment": "Удалите заражённые растения, продезинфицируйте инструменты и избегайте контакта с табачными изделиями при уходе за посадками.",
    "prevention": "Протравливайте семена и обеззараживайте почву перед посадкой."
  },
  "Tomato___healthy": {
    "title": "Здоровый томат",
    "pathogen": "нет",
    "plant_name": "Томат",
    "description": "Растение выглядит здоровым, пятна или вредители не обнаружены.",
    "treatment": "Продолжайте регулярный уход, полив и подкормки.",
    "prevention": "Проветривайте теплицу и следите за балансом питания."
  }
}